
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |        2 |           4 |            2 |
## Affected resources by action

|  Action  | Resources                                                                                           |
|:--------:|:----------------------------------------------------------------------------------------------------|
|    🟡    | `module.actions-runner-noble.aws_autoscaling_group.actions-runner`                                  |
|    🟡    | `module.actions-runner-noble.module.deregistration.aws_s3_object.lambda_package`                    |
|    🟡    | `module.actions-runner-noble.module.registration.aws_s3_object.lambda_package`                      |
|    🟡    | `module.actions-runner-noble.module.record_metric.module.lambda_monitored.aws_lambda_function.this` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner-noble.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
        id                               = "actions-runner-20250505203133193000000009-KWX4No"
        name                             = "actions-runner-20250505203133193000000009-KWX4No"
        # (31 unchanged attributes hidden)

      - tag {
          - key                 = "module_version" -> null
          - propagate_at_launch = true -> null
          - value               = "2.19.0" -> null
        }
      + tag {
          + key                 = "module_version"
          + propagate_at_launch = true
          + value               = "3.0.0"
        }

        # (14 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.deregistration.aws_s3_object.lambda_package will be updated in-place
  ~ resource "aws_s3_object" "lambda_package" {
        id                            = "e02ee93e-3897-41b0-a68a-a787f4572180.zip"
      ~ source                        = "../terraform/terraform-aws-actions-runner/modules/runner_deregistration/e02ee93e-3897-41b0-a68a-a787f4572180.zip" -> ".terraform/modules/actions-runner-noble/modules/runner_deregistration/e02ee93e-3897-41b0-a68a-a787f4572180.zip"
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (24 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.aws_s3_object.lambda_package will be updated in-place
  ~ resource "aws_s3_object" "lambda_package" {
        id                            = "a4834f11-bf71-f8e3-1d7d-77d44bf0c47b.zip"
      ~ source                        = "../terraform/terraform-aws-actions-runner/modules/runner_registration/a4834f11-bf71-f8e3-1d7d-77d44bf0c47b.zip" -> ".terraform/modules/actions-runner-noble/modules/runner_registration/a4834f11-bf71-f8e3-1d7d-77d44bf0c47b.zip"
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (24 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.module.lambda_monitored.data.archive_file.lambda_source_hash will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_source_hash" {
      + excludes            = [
          + "*.pyc",
          + "*.pyo",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "./.build/actions-runner-20250505203133193000000009-KWX4No_record_metric-cd99ac66495a1f96b644c5fc55d839e6.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/record_metric/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.record_metric.module.lambda_monitored.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "actions-runner-20250505203133193000000009-KWX4No_record_metric"
      ~ last_modified                  = "2025-11-10T05:48:48.601+0000" -> (known after apply)
      ~ s3_key                         = "actions-runner-20250505203133193000000009-KWX4No_record_metric/385c1272eba06ddf806d91fb197e2de3.zip" -> (known after apply)
      ~ source_code_hash               = "R23hOQ2UKWskx9P36+B/A2P2/d1qwNEKevs0EEfaPBY=" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/lambda-monitored/aws"
            "environment"       = "development"
            "module_version"    = "0.3.5"
            "service"           = "actions-runner"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.record_metric.module.lambda_monitored.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::actions-runner-202505052031331930000020251110054728437800000003/actions-runner-20250505203133193000000009-KWX4No_record_metric/385c1272eba06ddf806d91fb197e2de3.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "0e7ae67b815889e6ce2bdbfe38ec67e4-5" -> (known after apply)
      ~ id                            = "actions-runner-20250505203133193000000009-KWX4No_record_metric/385c1272eba06ddf806d91fb197e2de3.zip" -> (known after apply)
      ~ key                           = "actions-runner-20250505203133193000000009-KWX4No_record_metric/385c1272eba06ddf806d91fb197e2de3.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "./.build/actions-runner-20250505203133193000000009-KWX4No_record_metric-afe8b1ffeaf772c4feee0fccbf9fa9d3.zip" -> "./.build/actions-runner-20250505203133193000000009-KWX4No_record_metric-cd99ac66495a1f96b644c5fc55d839e6.zip"
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/lambda-monitored/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.module.lambda_monitored.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "4125816950975992563" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "source_hash"       = "58001c42be80c55139c242db958bd168" -> "71b7dfe34d2bdb35f37f1bebe0c99815"
            # (4 unchanged elements hidden)
        }
    }

Plan: 2 to add, 4 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIsICJjaGFuZ2UiOiA0LCAiZGVzdHJveSI6IDJ9fQ==
```
</details>